public class Theory {

    /**
     * операции в программировании:
     *
     * = - присвоение (int a = 0 - обьявить переменную a и присвоить ей значение 1)
     * == - возвращает true если переменные равны и false если не равны
     * != - возвращает false если переменные равны и true если не равны
     * && - логическое И
     * || - логическое ИЛИ
     * ! - логическое НЕ
     * > - больше
     * < - меньше
     * >=  - больше или равно
     * <= - меньше или равно
     * % - остаток от деления (так удобно определять четные числа, например 5 % 2 = 1, читается как остаток от деления 5 на 2 = 1)
     * ++ - увеличить на 1 (операция инкремент)
     * -- - уменьшить на 1 (операция декремент)
     *
     * Примитивные типы данных
     * целочисленные
     * byte
     * short
     * int
     * long or (123456789L)
     *
     * с плавающей точкой
     * float (1.0f)
     * double
     *
     * логическая
     * boolean
     *
     * символьная
     * char ('a')       char letter = 'a'
     *
     * Не примитивные типы данных (ссылочные)
     * это все типы данных, у кот есть класс
     * String
     *
     *
     *
     * Модификаторы доступа
     * private - доступен только в рамках одного класса
     * default/package private - пишется без ключевого слова. Как приватный, плюс в рамках одной папки
     * protected - как 2 предыдущих или в классе наследнике
     * public - отовсюду, в рамках одного модуля
     *
     * наследование лучше использовать когда Cat является (is-a) Animal
     * композиция - это когда отношения между объктами можно описать фразой has-a
     * При композиции в нашем классе появляется поле с типом класса, функционал которого нам необходим
     *
     */



}
